CouetteFlowWithPressureGrad/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      http://www.cfdyna.com                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

length 20;
height 1;
width 0.1;

vertices
(
    (0          #calc "-1.0*$height/2.0"  #calc "-$width")  // 0
    (0          #calc "-1.0*$height/2.0"  $width         )  // 1
    (0          #calc "$height/2.0"       $width         )  // 2
    (0          #calc "$height/2.0"       #calc "-$width")  // 3
    ($length    #calc "-1.0*$height/2.0"  #calc "-$width")  // 4
    ($length    #calc "-1.0*$height/2.0"  $width         )  // 5
    ($length    #calc "$height/2.0"       $width         )  // 6
    ($length    #calc "$height/2.0"       #calc "-$width")  // 7
);

blocks
(
    hex (3 2 1 0   7 6 5 4) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 6 5 4)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (2 6 7 3)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
